Repository: GeoffreyV/norminette_IUTACY
Catalog: norminette/locale/*/LC_MESSAGES/norminette.po
Languages: fr_fr

source: Spaces at beginning of line
fr_fr: Espaces au début de la ligne

source: Found tab when expecting space
fr_fr: Tabulation trouvée alors qu’un espace était attendu

source: Two or more consecutives spaces
fr_fr: Deux espaces consécutifs ou plus

source: Two or more consecutives white spaces
fr_fr: Deux blancs consécutifs ou plus

source: missing space before operator
fr_fr: Espace manquant avant l’opérateur

source: missing space after operator
fr_fr: Espace manquant après l’opérateur

source: extra space before operator
fr_fr: Espace en trop avant l’opérateur

source: extra space after operator
fr_fr: Espace en trop après l’opérateur

source: Missing space after parenthesis (brace/bracket)
fr_fr: Espace manquant après une parenthèse (ou accolade/crochet)

source: Missing space before parenthesis (brace/bracket)
fr_fr: Espace manquant avant une parenthèse (ou accolade/crochet)

source: Extra space after parenthesis (brace/bracket)
fr_fr: Espace en trop après une parenthèse (ou accolade/crochet)

source: Extra space before parenthesis (brace/bracket)
fr_fr: Espace en trop avant une parenthèse (ou accolade/crochet)

source: space after pointer
fr_fr: Espace après le pointeur

source: Unexpected space/tab at line start
fr_fr: Espace ou tabulation inattendu(e) au début de la ligne

source: bad spacing before pointer
fr_fr: Espacement incorrect avant le pointeur

source: Found space when expecting tab before function name
fr_fr: Espace trouvé au lieu d’une tabulation avant le nom de la fonction

source: extra tabs before function name
fr_fr: Tabulations en trop avant le nom de la fonction

source: extra tabs before typedef name
fr_fr: Tabulations en trop avant le typedef

source: missing tab before function name
fr_fr: Tabulation manquante avant le nom de la fonction

source: missing tab before variable name
fr_fr: Tabulation manquante avant le nom de la variable

source: Missing tab before typedef name
fr_fr: Tabulation manquante avant le typedef

source: extra tab before variable name
fr_fr: Tabulation en trop avant le nom de la variable

source: line too long
fr_fr: Ligne trop longue

source: Expected parenthesis
fr_fr: Parenthèse attendue

source: missing type qualifier or identifier in function arguments
fr_fr: Qualificateur de type ou identifiant manquant dans les arguments

source: user defined identifiers should contain only lowercase characters, digits or '_'
fr_fr: Les identifiants définis doivent contenir uniquement des minuscules, chiffres ou '_'

source: Missing tabs for indent level
fr_fr: Tabulations manquantes pour le niveau d’indentation

source: Extra tabs for indent level
fr_fr: Tabulations en trop pour le niveau d’indentation

source: Extra whitespaces for indent level
fr_fr: Espaces en trop pour le niveau d’indentation

source: Found space when expecting tab
fr_fr: Espace trouvé au lieu d’une tabulation

source: Function has more than 25 lines
fr_fr: La fonction dépasse 25 lignes

source: Space on empty line
fr_fr: Espace sur une ligne vide

source: Space before newline
fr_fr: Espace avant un saut de ligne

source: Too many instructions on a single line
fr_fr: Trop d’instructions sur une seule ligne

source: Missing space after preprocessor directive
fr_fr: Espace manquant après une directive de préprocesseur

source: Unrecognized preprocessor statement
fr_fr: Instruction de préprocesseur non reconnue

source: Preprocessor statement not at the beginning of the line
fr_fr: Instruction de préprocesseur non en début de ligne

source: Preprocessor statement must only contain constant defines
fr_fr: Les directives doivent contenir uniquement des définitions constantes

source: Expected EOL after preprocessor statement
fr_fr: Fin de ligne attendue après une directive de préprocesseur

source: If preprocessor statement without endif
fr_fr: Directive if sans endif correspondant

source: Elif preprocessor statement without if or elif
fr_fr: Directive elif sans if ou elif correspondant

source: Ifdef preprocessor statement without endif
fr_fr: Directive ifdef sans endif correspondant

source: Ifndef preprocessor statement without endif
fr_fr: Directive ifndef sans endif correspondant

source: Else preprocessor statement without if or elif
fr_fr: Directive else sans if ou elif correspondant

source: Endif preprocessor statement without if, elif or else
fr_fr: Directive endif sans if, elif ou else correspondant

source: Bad preprocessor indentation
fr_fr: Indentation incorrecte dans le préprocesseur

source: Multiline preprocessor statement is forbidden
fr_fr: Les directives préprocesseur sur plusieurs lignes sont interdites

source: Preprocessor statements are only allowed in the global scope
fr_fr: Les directives préprocesseur sont autorisées uniquement dans la portée globale

source: User defined typedef must start with t_
fr_fr: Les typedef définis doivent commencer par t_

source: Structure name must start with s_
fr_fr: Le nom de la structure doit commencer par s_

source: Enum name must start with e_
fr_fr: Le nom de l’enum doit commencer par e_

source: Union name must start with u_
fr_fr: Le nom du union doit commencer par u_

source: Global variable must start with g_
fr_fr: Le nom des variables globales doit commencer par g_

source: Missing whitespace before typedef name
fr_fr: Espace manquant avant le nom du typedef

source: Global variable present in file. Make sure it is a reasonable choice.
fr_fr: Variable globale détectée. Assurez-vous que cela est justifié.

source: Logic operator at the end of line
fr_fr: Opérateur logique à la fin d’une ligne

source: Empty line at start of file
fr_fr: Ligne vide au début du fichier

source: Empty line in function
fr_fr: Ligne vide dans une fonction

source: Empty line at end of file
fr_fr: Ligne vide à la fin du fichier

source: Variable declared in incorrect scope
fr_fr: Variable déclarée dans une portée incorrecte

source: Missing type in variable declaration
fr_fr: Type manquant dans une déclaration de variable

source: Variable declaration not at start of function
fr_fr: Déclaration de variable non placée au début de la fonction

source: Too many variables declarations in a function
fr_fr: Trop de déclarations de variables dans une fonction

source: Too many functions in file
fr_fr: Trop de fonctions dans un seul fichier

source: Expected newline after brace
fr_fr: Retour à la ligne attendu après une accolade

source: Consecutive newlines
fr_fr: Sauts de ligne consécutifs

source: Functions must be separated by a newline
fr_fr: Les fonctions doivent être séparées par un saut de ligne

source: Variable declarations must be followed by a newline
fr_fr: Les déclarations doivent être suivies d’un saut de ligne

source: Preprocessor statement must be followed by a newline
fr_fr: Une directive doit être suivie d’un saut de ligne

source: Multiple assignations on a single line
fr_fr: Plusieurs affectations sur une seule ligne

source: Multiple declarations on a single line
fr_fr: Plusieurs déclarations sur une seule ligne

source: Declaration and assignation on a single line
fr_fr: Déclaration et affectation sur une seule ligne

source: Forbidden control structure
fr_fr: Structure de contrôle interdite

source: Missing space after keyword
fr_fr: Espace manquant après un mot-clé

source: Return value must be in parenthesis
fr_fr: La valeur de retour doit être entre parenthèses

source: Expected semicolon
fr_fr: Point-virgule attendu

source: Expected tab
fr_fr: Tabulation attendue

source: Empty function argument requires void
fr_fr: Un argument vide de fonction doit utiliser void

source: Misaligned variable declaration
fr_fr: Déclaration de variable mal alignée

source: Misaligned function declaration
fr_fr: Déclaration de fonction mal alignée

source: Comment is invalid in this scope
fr_fr: Commentaire invalide à cet endroit

source: Macro name must be capitalized
fr_fr: Les macros doivent être en majuscules

source: Macro functions are forbidden
fr_fr: Les fonctions macros sont interdites

source: Assignment in control structure
fr_fr: Affectation dans une structure de contrôle

source: Variable length array forbidden
fr_fr: Les tableaux de taille variable sont interdits

source: Function has more than 4 arguments
fr_fr: La fonction a plus de 4 arguments

source: .c file includes are forbidden
fr_fr: Les includes de fichiers .c sont interdits

source: Include must be at the start of file
fr_fr: Les includes doivent être au début du fichier

source: Header protection must include all the instructions
fr_fr: La protection d’en-tête doit englober toutes les instructions

source: Instructions after header protection are forbidden
fr_fr: Les instructions après la protection d’en-tête sont interdites

source: Wrong header protection name
fr_fr: Nom de protection d’en-tête incorrect

source: Header protection must be in uppercase
fr_fr: La protection d’en-tête doit être en majuscules

source: Multiple header protections, only one is allowed
fr_fr: Une seule protection d’en-tête est autorisée

source: Header protection not containing #define
fr_fr: La protection d’en-tête doit contenir un #define

source: Ternaries are forbidden
fr_fr: Les ternaires sont interdits

source: Too many values on define
fr_fr: Trop de valeurs dans un define

source: Newline in declaration
fr_fr: Retour à la ligne dans une déclaration

source: Multiple instructions in single line control structure
fr_fr: Instructions multiples dans une seule ligne de contrôle

source: Newline in define
fr_fr: Retour à la ligne dans un define

source: Missing identifier in typedef declaration
fr_fr: Identifiant manquant dans un typedef

source: Label statements are forbidden
fr_fr: Les labels sont interdits

source: Goto statements are forbidden
fr_fr: Les instructions goto sont interdites

source: Preprocessors can only be used in the global scope
fr_fr: Les directives préprocesseur sont limitées à la portée globale

source: Function prototype in incorrect scope
fr_fr: Prototype de fonction dans une portée incorrecte

source: Statement is in incorrect scope
fr_fr: Instruction dans une portée incorrecte

source: Incorrect values in define
fr_fr: Valeurs incorrectes dans un define

source: Expected newline before brace
fr_fr: Saut de ligne attendu avant une accolade

source: Expected newline after control structure
fr_fr: Saut de ligne attendu après une structure de contrôle

source: Unrecognized variable type
fr_fr: Type de variable non reconnu

source: Comment must be on its own line or at end of a line
fr_fr: Un commentaire doit être sur sa propre ligne ou à la fin d'une ligne

source: Comma at line start
fr_fr: Virgule en début de ligne

source: Mixed spaces and tabs
fr_fr: Espaces et tabulations mélangés

source: Function attribute must be at the end of line
fr_fr: L’attribut de fonction doit être en fin de ligne

source: Missing or invalid 42 header
fr_fr: En-tête 42 manquant ou invalide

source: Missing space between include and filename
fr_fr: Espace manquant entre include et le nom de fichier

source: Enums, structs and unions need to be defined only in global scope
fr_fr: Les enums, structs et unions doivent être définis uniquement dans la portée globale

source: Typedef declaration are not allowed in .c files
fr_fr: Les typedef ne sont pas autorisés dans les fichiers .c

source: Struct declaration are not allowed in .c files
fr_fr: Les structs ne sont pas autorisés dans les fichiers .c

source: Union declaration are not allowed in .c files
fr_fr: Les unions ne sont pas autorisés dans les fichiers .c

source: Enum declaration are not allowed in .c files
fr_fr: Les enums ne sont pas autorisés dans les fichiers .c

source: Unexpected end of file (EOF) while parsing a char
fr_fr: Fin de fichier inattendue lors de l’analyse d’un caractère

source: Unexpected end of line (EOL) while parsing a char
fr_fr: Fin de ligne inattendue lors de l’analyse d’un caractère

source: Unexpected end of file (EOF) while parsing a multiline comment
fr_fr: Fin de fichier inattendue dans un commentaire multiligne

source: Unexpected end of file (EOF) while parsing a string
fr_fr: Fin de fichier inattendue dans une chaîne de caractères

source: Empty character constant
fr_fr: Constante de caractère vide

source: Character constants can have only one character
fr_fr: Les constantes de caractère ne doivent avoir qu’un seul caractère

source: This suffix is invalid
fr_fr: Ce suffixe est invalide

source: Invalid suffix for float/double literal constant
fr_fr: Suffixe invalide pour une constante float/double

source: Invalid binary integer literal
fr_fr: Constante entière binaire invalide

source: Invalid octal integer literal
fr_fr: Constante entière octale invalide

source: Invalid hexadecimal integer literal
fr_fr: Constante entière hexadécimale invalide

source: Potential maximal munch detected
fr_fr: Maximal munch potentiellement détecté

source: No hexadecimal digits followed by the \x
fr_fr: Aucun chiffre hexadécimal après \x

source: Unknown escape sequence
fr_fr: Séquence d’échappement inconnue

source: Exponent has no digits
fr_fr: Exposant sans chiffre

source: Multiple dots in float constant
fr_fr: Plusieurs points dans une constante flottante

source: Multiple 'x' in hexadecimal float constant
fr_fr: Plusieurs ‘x’ dans une constante flottante hexadécimale
